# напишите программу, в которой пользовательбудет задавать две строки,
# программа - определять кол-во вхождений одной строки в другой 

n=input()
m=input()

print(n.count(m))